app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    if params[:ratings]
      @ratings_selected = params[:ratings].keys
    else
      @ratings_selected = @all_ratings
      session[:last_sort_by] = params[:sort_by]
    end
    @actual_sort_by = session[:last_sort_by]
    @movies = Movie.where(rating: @ratings_selected).order( @actual_sort_by )
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R') ORDER BY rating

  def show
    id = params[:id]
    @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]